cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'fzf'
brew 'ripgrep'
brew 'thefuck'
brew 'tmux'
brew 'ctags'
brew 'neovim'
brew 'mitmproxy'
brew 'tree'
brew 'ffmpeg'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'openssl'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'roundup'
brew 'spaceman-diff'
brew 'httpie'
brew 'mongodb'
brew 'spark'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'

cask 'iterm2'
cask '1password'
cask 'firefox'
cask 'google-chrome'
cask 'handbrake'
cask 'ngrok'
cask 'slack'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
cask 'dash'
cask 'telegram'
cask 'spotify'
cask 'sequel-pro'
cask 'dropbox'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'menubar-stats'
cask 'flux'
cask 'postman'
cask 'recordit'
