cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ack'
brew 'fzf'
brew 'the_silver_searcher'
brew 'git'
brew 'gh'
brew 'ripgrep'
brew 'tmux'
brew 'ctags'
brew 'neovim'
brew 'mitmproxy'
brew 'tree'
brew 'ffmpeg'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'openssl'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'roundup'
brew 'spaceman-diff'
brew 'httpie'
brew 'wget'
brew 'node'
brew 'yarn'
brew 'youtube-dl'
brew 'mkcert'
brew 'chruby'
brew 'ruby-install'
brew 'python3'
brew 'mas'
brew 'thefuck'
brew '1password-cli'

cask 'iterm2'
cask '1password'
cask 'firefox'
cask 'google-chrome'
cask 'firefox'
cask 'handbrake'
cask 'ngrok'
cask 'slack'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
cask 'dash'
cask 'sequel-ace'
cask 'dropbox'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'flux'
cask 'postman'
cask 'recordit'
cask 'appcleaner'
cask 'charles'
cask 'inkscape'
cask 'tripmode'
cask 'istat-menus'
cask 'visual-studio-code'
cask 'tailscale'
cask 'rectangle'
